Revit 2027 API
ParameterTypeId.CurveByPointsProjectionType Property
 "Projection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveByPointsProjectionType { get; }
Public Shared ReadOnly Property CurveByPointsProjectionType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveByPointsProjectionType {
	ForgeTypeId^ get ();
}
static member CurveByPointsProjectionType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace